{
  "backend/main.mo": "Defines photo, album, user profile types and maps, with authorization checks and CRUD operations for profiles and albums.",
  "feature_evidence.json": "Lists implemented features with related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short human-written summaries of their functionality.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites and steps for local and production IC deployments.",
  "frontend/index.css": "Tailwind base stylesheet defining color tokens, themes, and global styling for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root container and main React script.",
  "frontend/src/App.tsx": "Sets up routes, layout, theming, and authentication-guarded pages for the React app.",
  "frontend/src/components/AlbumNameEditor.tsx": "Editable album name component with save and cancel logic using updateAlbumName mutation.",
  "frontend/src/components/AuthButton.tsx": "Sign-in/out button handling Internet Identity authentication and session clearing.",
  "frontend/src/components/Header.tsx": "Sticky header with branding, navigation, auth controls, copy-link button, and help dialog trigger.",
  "frontend/src/components/PhotoCaptionEditor.tsx": "Provides an inline caption editor for a photo with save and cancel handling using mutation hooks.",
  "frontend/src/components/PhotoGrid.tsx": "Renders a responsive grid of photos and opens a viewer when an image is clicked.",
  "frontend/src/components/PhotoReorderControls.tsx": "Offers move up/down controls to reorder photos in an album and updates the backend order.",
  "frontend/src/components/PhotoUploadPanel.tsx": "Handles multi-photo uploads with progress tracking, validation, and success/error states.",
  "frontend/src/components/PhotoViewer.tsx": "Displays a modal photo viewer with navigation, download, caption editing, and optional reorder controls.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new users to enter a name and save their profile.",
  "frontend/src/components/RequireAuth.tsx": "Gates content behind authentication, showing loading or sign‑in prompts as needed.",
  "frontend/src/components/ShareSettingsPanel.tsx": "Manages creation, display, copying, and revocation of share links for an album.",
  "frontend/src/components/TroubleshootingDialog.tsx": "A dialog component offering troubleshooting tips and allowing users to copy the app link or perform a hard refresh.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides authentication and authorization state, including identity, user profile, and profile setup logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, exposing identity state, login/logout methods, and status handling via a provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, albums, and photos through the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light and dark theme variables and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AlbumDetailPage.tsx": "Displays an album’s details with photo grid, upload panel, share panel, and album name editing, handling loading and error states.",
  "frontend/src/pages/AlbumListPage.tsx": "Renders the album list with a hero section, loads albums, and provides a dialog form to create new albums.",
  "frontend/src/pages/SharedAlbumPage.tsx": "Displays a read‑only shared album by shareId, handling loading, error states, and showing a photo grid.",
  "frontend/src/utils/appLink.ts": "Provides helpers to get the current app URL and copy it to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin usage.",
  "project_state.json": "Metadata describing the project state, requirements, existing features, and known deployment issue."
}